[
    {
        "id" : "Robert-Vela",
        "firstName":"Dr. Robert H.",
        "lastName" : "Vela Jr.",
        "fullName" : "Dr. Robert H. Vela Jr.",
        "title" : "President",
        "email" : "robert.vela@tamuk.edu",
        "image" : "Robert-Vela.jpg",
        "bio" : "<p>Dr. Robert H. Vela Jr. began serving as the 22nd president of Texas A&amp;M University-Kingsville on June 15, 2022. His career has been dedicated to promoting access and opportunity to higher education across the state.&nbsp;<\/p>\r\n<p>Dr. Vela previously served as President of San Antonio College—one of the largest community colleges in the nation— from 2014-June 2022. Under his collaborative leadership, Dr. Vela developed a strategic plan that advanced the Alamo Community College District goal of transforming San Antonio College into the best community college in the nation.&nbsp;<\/p>\r\n<p>In 2021, the college earned the Aspen Prize for Community College Excellence--the nation’s premier recognition of achievement and performance among America’s community colleges.<\/p>\r\n<p>Dr. Vela launched his career in higher education at Texas A&amp;M University-Kingsville in 1997 and served in various roles at the university, including as Upward Bound Program Coordinator and Director of the Teacher Development Center.&nbsp;<\/p>\r\n<p>In 2021, Dr. Vela joined the Board of Directors of&nbsp;<em>Excelencia<\/em>&nbsp;in Education, an organization that accelerates Latino student success in higher education to address the U.S. economy’s need for a highly educated workforce and civic leadership.<\/p>\r\n<p>A nationally-recognized leader in higher education, Dr. Vela has also served as the President of the National Community College Hispanic Council and on the American Association of Community Colleges Board of Directors. In 2018, he was an integral part of a team that &nbsp;received the Malcolm Baldridge National Quality Award from the U.S. Department of Commerce.<\/p>\r\n<p>He has taught courses in higher education administration and leadership, educational leadership and counseling throughout his 20 plus years in higher education.&nbsp;<\/p>\r\n<p>A native of Alice, TX, Dr. Vela earned bachelor’s, master’s and doctoral degrees from Texas A&amp;M-Kingsville. In 2015, he received the Javelina Distinguished Alumni Award.&nbsp;<\/p>",
        "oversees" : "<ul class=\"officelist\">\r\n        <li><a href=\"..\/academicaffairs\/index.html\" target=\"\">Academic Affairs<\/a><\/li>\r\n        <li><a href=\"https:\/\/www.javelinagiving.org\/\" target=\"_blank\" rel=\"noopener\">Alumni and Giving\/Foundation<\/a><\/li>\r\n        <li><a href=\"president\/chief-of-staff.html\" target=\"\">Chief of Staff<\/a><\/li>\r\n        <li><a href=\"..\/enrollment-management\/index.html\" target=\"\">Enrollment Management<\/a><\/li>\r\n        <li><a href=\"..\/finance\/index.html\" target=\"\">Finance and Financial Services<\/a><\/li>\r\n        <li><a href=\"https:\/\/recsports.tamuk.edu\/\" target=\"_blank\" rel=\"noopener\">Intercollegiate Athletics and Campus Recreation<\/a><\/li>\r\n        <li><a href=\"..\/marcomm\/index.html\" target=\"\">Marketing and Communications<\/a><\/li>\r\n        <li><a href=\"president\/index.html\" target=\"\">Office of the President<\/a><\/li>\r\n        <li><a href=\"..\/staff-council\/index.html\" rel=\"noopener\" target=\"\">Staff Council<\/a><\/li>\r\n        <\/ul>"
    },
    {
        "id" : "Jacob-Flournoy",
        "firstName":"Jacob",
        "lastName" : "Flournoy",
        "fullName" : "Jacob Flournoy",
        "title" : "Vice President for Finance and Chief Financial Officer",
        "email" : "jacob.flournoy@tamuk.edu",
        "image" : "Jacob-Flournoy.jpg",
        "bio" : "<p>Jacob Flournoy serves as the Vice President for Finance and CFO for the Texas A&amp;M University-Kingsville. Prior to coming to TAMU-Kingsville, Mr. Flournoy served in leadership positions with the University of Arkansas System, the University of Oklahoma, and the University of Texas Health Science Center at San Antonio. He has worked with every level of management and with many types of institution including community colleges, HBCUs, regional universities, flagship universities, land grant institutions, research institutions, comprehensive medical centers and foundations. He has a proven record of achievement for improving and strengthening higher education institutions related to the services they provide and the impact they have on their constituencies.&nbsp; His work has been reported on and profiled in international, national, state, and local news outlets and publications.<\/p>\r\n<p>Mr. Flournoy received his BBA degree from the University of North Texas and his MBA degree from the University of Oklahoma. &nbsp;In addition to being a Certified Public Accountant, he is a Chartered Global Management Accountant, Certified Internal Auditor, Certified Information Systems Auditor, and Certified Fraud Examiner.&nbsp; He is licensed in Texas as a CPA and is a member of the American Institute of Certified Public Accountants.&nbsp;<\/p>\r\n<p>Mr. Flournoy has made many contributions to both state and national professional organizations. He has taught accounting and auditing courses for the AICPA in 25 states and Washington DC to over 1,600 CPAs. He has also engaged in contracts with the AICPA, Professional Examination Service, and ACT, Inc. to write and edit questions for the Auditing and Attestation, Financial Accounting &amp; Reporting, and Business Environment &amp; Concepts parts of the Uniform CPA Exam.<\/p>\r\n<p>In 2014, Mr. Flournoy received the Arkansas Society of Certified Public Accountants Outstanding CPA in Government Award. In 2015, he was selected as the AICPA’s Outstanding CPA in Government Impact Award, State Level.&nbsp; In 2019, he received the Arkansas Diamond Award from the Arkansas Secretary of State’s Office. The Diamond Award is the Secretary of State’s highest award. It is given to recognize the exemplary quality of a person’s contributions to the State of Arkansas.<\/p>",
        "oversees":"<ul class=\"officelist\">\r\n<li><a href=\"..\/finance\/budget\/index.html\" target=\"\">Budget Services<\/a><\/li>\r\n<li><a href=\"..\/finance\/compliance\/index.html\" target=\"\">Compliance<\/a><\/li>\r\n<li><a href=\"..\/finance\/risk\/index.html\" target=\"\">Enterprise Risk Management<\/a><\/li>\r\n<li><a href=\"..\/finance\/fpc\/index.html\" target=\"\">Facilities Planning and Construction<\/a><\/li>\r\n<li><a href=\"..\/finance\/financial-services\/index.html\" target=\"\">Financial Services<\/a><\/li>\r\n<li><a href=\"..\/finance\/its\/index.html\" target=\"\">Information Technology Services<\/a><\/li>\r\n<li><a href=\"..\/ppo\/index.html\" target=\"\">Physical Plant<\/a><\/li>\r\n<li><a href=\"..\/finance\/procurement\/index.html\" target=\"\">Procurement and Travel Services<\/a><\/li>\r\n<li><a href=\"..\/msub\/index.html\" target=\"\">Property Management and Auxiliary Services<\/a><\/li>\r\n<li><a href=\"..\/upd\/index.html\" target=\"\">University Police Department (UPD)<\/a><\/li>\r\n<\/ul>"
    },
    {
        "id" : "rito-silva",
        "firstName":"Rito",
        "lastName" : "Silva",
        "fullName" : "Dr. Rito Silva",
        "title" : "Vice President, Enrollment Services & Student Affairs",
        "email" : "jacob.flournoy@tamuk.edu",
        "image" : "Rito.jpg",
        "bio" : "",
        "oversees" : "<ul class=\"officelist\">\r\n<li><a href=\"..\/enrollment-management\/admission\/index.html\" target=\"\">Admissions<\/a><\/li>\r\n<li><a href=\"..\/recsports\/index.html\" target=\"\">Campus Recreation &amp; Fitness<\/a><\/li>\r\n<li><a href=\"..\/dean\/index.html\" target=\"\">Dean of Students<\/a><\/li>\r\n<li><a href=\"..\/enrollment-management\/finaid\/index.html\" target=\"\">Financial Aid<\/a><\/li>\r\n<li><a href=\"..\/enrollment-management\/scholarships\/index.html\" target=\"\">Scholarships<\/a><\/li>\r\n<li><a href=\"..\/student-affairs\/index.html\" target=\"\">Student Affairs<\/a><\/li>\r\n<li><a href=\"..\/enrollment-management\/veterans\/index.html\" target=\"\">Veterans Affairs<\/a><\/li>\r\n<\/ul>"
    }
]